import React from 'react';
import '../styles/Opinions.css'

const Opinions = () => {
    return (
        <div className="opinion-wrap">
            <div className="write-box-wrap">
                <div className="election-name">
                    2021 재보궐선거
                </div>
                <div className="write-box">
                    <select name="" id="selectCan">
                        <option value="">응원하는 후보를 선택하세요</option>
                        <option value="">오세훈</option>
                        <option value="">박영선</option>
                        <option value="">허경영</option>
                    </select>
                    <input type="text" placeholder="100자 이하의 의견을 남겨주세요" />
                    <button>등록</button>
                </div>
            </div>
            <div className="opinion-line">
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는  양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는  양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는  총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는  양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는  양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다. 이는 지난 총선과 완전히 대비되는 양상인데요. 특히 20대 남성의 지지율이 압도적이었습니다.
                </div>
                <div className="opinion">
                    이번 재보궐선거는 압도적인 차이로 국민의힘이 승리했습니다.  지지율이 압도적이었습니다.
                </div>

            </div>
        </div>
    );
};

export default Opinions;